# Sheet 3

In [2]:
#13 Feb
import pandas as pd
data_table = pd.DataFrame({'Name':['Sathish','Mary','John'], 'Age':[23,31,20]})

In [3]:
data_table

,Name,Age
0,Sathish,23
1,Mary,31
2,John,20

In [4]:
data_table["Age"]

In [5]:
import numpy as np
arr = np.array([2,5,7,4,1,9,5,2,6]).reshape(3,3,)
arr

In [8]:
table2 = pd.DataFrame(arr,columns=["D1","D2","D3"])

In [9]:
table2.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['D1', 'D2', 'D3'], dtype='object')]

In [10]:
table2.shape

(3, 3)

In [11]:
table2.ndim

2

In [12]:
table2.size

9

In [13]:
table2.columns

Index(['D1', 'D2', 'D3'], dtype='object')

In [14]:
table2.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
table2.columns = ("Col1","Col2","Col3")
table2

,Col1,Col2,Col3
0,2,5,7
1,4,1,9
2,5,2,6

In [16]:
table2.iloc[0]

In [19]:
table2.iloc[[0,1],2]

In [22]:
table2["Col2"][0]

5

In [23]:
table2.set_index("Col1",inplace = True)
table2

,Col2,Col3
Col1,,
2,5,7
4,1,9
5,2,6

In [25]:
table2.reset_index(inplace=True)
table2

,index,Col1,Col2,Col3
0,0,2,5,7
1,1,4,1,9
2,2,5,2,6

In [26]:
table2.sort_index(inplace=True)
table2

,index,Col1,Col2,Col3
0,0,2,5,7
1,1,4,1,9
2,2,5,2,6

In [27]:
emp = pd.DataFrame({"Name":["John","Mike","Loki","Steve"],
                    "Dep":["IT","HR","Finance","Manager"],
                    "Income":[44543,245432,234524,34534],
                    "Age":[23,34,21,41]})
emp

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41

In [28]:
emp["Dep"] == "IT"

In [30]:
varit = emp["Dep"] == "IT"
emp[varit]

,Name,Dep,Income,Age
0,John,IT,44543,23

In [32]:
emp[emp["Income"]>34578]

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21

In [35]:
emp[(emp["Age"]>30) | (emp["Income"]>223322)]

,Name,Dep,Income,Age
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41

In [36]:
emp[(~emp["Age"]>30) | (emp["Income"]>223322)]

,Name,Dep,Income,Age
1,Mike,HR,245432,34
2,Loki,Finance,234524,21

In [39]:
emp.append({"Name":"Vetri","Dep":"Software","Income":53453,"Age":27},ignore_index=True)

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41
4,Vetri,Software,53453,27

In [40]:
emp.drop(index=2)

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
3,Steve,Manager,34534,41

In [43]:
emp["Exp"] = [2,3,7,1]
emp

,Name,Dep,Income,Age,Exp
0,John,IT,44543,23,2
1,Mike,HR,245432,34,3
2,Loki,Finance,234524,21,7
3,Steve,Manager,34534,41,1

In [44]:
emp.drop(columns=["Exp"])

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41

In [1]:
#15 Feb
import pandas as pd
class1 = pd.DataFrame({"Name":['Lokesh','Sathish','Vikas'],"Stu No":[123,456,789],"GPA":[7.8,8.1,9.3]})
class2 = pd.DataFrame({"Name":['Vigesh','Varun','Siraj'],"Stu No":[345,987,567],"GPA":[8.6,8.5,9.1]})
class1
class2

,Name,Stu No,GPA
0,Vigesh,345,8.6
1,Varun,987,8.5
2,Siraj,567,9.1

In [2]:
pd.concat([class1,class2])

,Name,Stu No,GPA
0,Lokesh,123,7.8
1,Sathish,456,8.1
2,Vikas,789,9.3
0,Vigesh,345,8.6
1,Varun,987,8.5
2,Siraj,567,9.1

In [3]:
pd.concat([class1,class2],join="inner")

,Name,Stu No,GPA
0,Lokesh,123,7.8
1,Sathish,456,8.1
2,Vikas,789,9.3
0,Vigesh,345,8.6
1,Varun,987,8.5
2,Siraj,567,9.1

In [5]:
pd.merge(class1,class2,how="left")

,Name,Stu No,GPA
0,Lokesh,123,7.8
1,Sathish,456,8.1
2,Vikas,789,9.3

In [6]:
pd.merge(class1,class2,how="right")

,Name,Stu No,GPA
0,Vigesh,345,8.6
1,Varun,987,8.5
2,Siraj,567,9.1

In [7]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio","Julia","Michael","Sarath","Jakub","Chris"],
                          "Department":["IT","Human Resources","Finance","Supply Chain","Finance","Marketing","IT","Human Resources","Law"],
                          "Income":[4800,5200,6600,5700,7200,8400,7700,4200,9400],
                          "Age":[24,28,33,41,22,46,31,27,39],
                          "Experience":[2,5,9,17,1,24,10,6,13]})
employees

,Name,Department,Income,Age,Experience
0,Josh,IT,4800,24,2
1,Mike,Human Resources,5200,28,5
2,Julia,Finance,6600,33,9
3,Sergio,Supply Chain,5700,41,17
4,Julia,Finance,7200,22,1
5,Michael,Marketing,8400,46,24
6,Sarath,IT,7700,31,10
7,Jakub,Human Resources,4200,27,6
8,Chris,Law,9400,39,13

In [8]:
employees.count()

In [9]:
employees["Department"].value_counts()

In [10]:
employees.mean()

<ipython-input-10-54586efc808d>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.mean()

In [11]:
employees.median()

<ipython-input-11-8010e1878e06>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.median()

In [12]:
employees.sum()

In [13]:
employees.min()

In [14]:
employees.max()

In [15]:
employees.std()

<ipython-input-15-561b13b4ed81>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.std()

In [16]:
employees.var()

<ipython-input-16-c383542361dd>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.var()

In [17]:
employees.describe()

,Income,Age,Experience
count,9.000000,9.000000,9.000000
mean,6577.777778,32.333333,9.666667
std,1746.981524,8.154753,7.416198
min,4200.000000,22.000000,1.000000
25%,5200.000000,27.000000,5.000000
50%,6600.000000,31.000000,9.000000
75%,7700.000000,39.000000,13.000000
max,9400.000000,46.000000,24.000000

In [18]:
employees.sem()

<ipython-input-18-c34e3d6562b9>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.sem()

In [21]:
df_n = pd.read_csv("netflix_titles.csv")

In [22]:
df_n.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [23]:
df_n.tail()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [25]:
df_n.shape

(8807, 12)

In [26]:
df_n.info

<bound method DataFrame.info of      show_id     type                  title         director  \
0         s1    Movie   Dick Johnson Is Dead  Kirsten Johnson
1         s2  TV Show          Blood & Water              NaN
2         s3  TV Show              Ganglands  Julien Leclercq
3         s4  TV Show  Jailbirds New Orleans              NaN
4         s5  TV Show           Kota Factory              NaN
...      ...      ...                    ...              ...
8802   s8803    Movie                 Zodiac    David Fincher
8803   s8804  TV Show            Zombie Dumb              NaN
8804   s8805    Movie             Zombieland  Ruben Fleischer
8805   s8806    Movie                   Zoom     Peter Hewitt
8806   s8807    Movie                 Zubaan      Mozez Singh

                                                   cast        country  \
0                                                   NaN  United States
1     Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...   South Africa
2     Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...            NaN
3                                                   NaN            NaN
4     Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...          India
...                                                 ...            ...
8802  Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...  United States
8803                                                NaN            NaN
8804  Jesse Eisenberg, Woody Harrelson, Emma Stone, ...  United States
8805  Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...  United States
8806  Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...          India

              date_added  release_year rating   duration  \
0     September 25, 2021          2020  PG-13     90 min
1     September 24, 2021          2021  TV-MA  2 Seasons
2     September 24, 2021          2021  TV-MA   1 Season
3     September 24, 2021          2021  TV-MA   1 Season
4     September 24, 2021          2021  TV-MA  2 Seasons
...                  ...           ...    ...        ...
8802   November 20, 2019          2007      R    158 min
8803        July 1, 2019          2018  TV-Y7  2 Seasons
8804    November 1, 2019          2009      R     88 min
8805    January 11, 2020          2006     PG     88 min
8806       March 2, 2019          2015  TV-14    111 min

                                              listed_in  \
0                                         Documentaries
1       International TV Shows, TV Dramas, TV Mysteries
2     Crime TV Shows, International TV Shows, TV Act...
3                                Docuseries, Reality TV
4     International TV Shows, Romantic TV Shows, TV ...
...                                                 ...
8802                     Cult Movies, Dramas, Thrillers
8803             Kids' TV, Korean TV Shows, TV Comedies
8804                            Comedies, Horror Movies
8805                 Children & Family Movies, Comedies
8806     Dramas, International Movies, Music & Musicals

                                            description
0     As her father nears the end of his life, filmm...
1     After crossing paths at a party, a Cape Town t...
2     To protect his family from a powerful drug lor...
3     Feuds, flirtations and toilet talk go down amo...
4     In a city of coaching centers known to train I...
...                                                 ...
8802  A political cartoonist, a crime reporter and a...
8803  While living alone in a spooky town, a young g...
8804  Looking to survive in a world taken over by zo...
8805  Dragged from civilian life, a former superhero...
8806  A scrappy but poor boy worms his way into a ty...

[8807 rows x 12 columns]>

In [27]:
df_n.describe()

,release_year
count,8807.000000
mean,2014.180198
std,8.819312
min,1925.000000
25%,2013.000000
50%,2017.000000
75%,2019.000000
max,2021.000000

In [28]:
df_n.describe(include=[object,'category',"int64"])

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
count,8807,8807,8807,6173,7982,7976,8797,8807.000000,8803,8804,8807,8807
unique,8807,2,8807,4528,7692,748,1767,NaN,17,220,514,8775
top,s1,Movie,Dick Johnson Is Dead,Rajiv Chilaka,David Attenborough,United States,"January 1, 2020",NaN,TV-MA,1 Season,"Dramas, International Movies","Paranormal activity at a lush, abandoned prope..."
freq,1,6131,1,19,19,2818,109,NaN,3207,1793,362,4
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014.180198,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.819312,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1925.000000,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013.000000,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017.000000,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2019.000000,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2021.000000,NaN,NaN,NaN,NaN

In [36]:
df_n["show_id"] == "s8803"

In [37]:
df_n.isna().sum()

In [38]:
df_n.nunique()